/*
 *  crd_esl.h
 *
 *  Created on: 2017Äê10ÔÂ6ÈÕ
 *      Author: xubov
 */

#ifndef CRD_ESL_H_
#define CRD_ESL_H_

#include <jendefs.h>

/****************************************************************************/
/***        Include Files                                                 ***/
/****************************************************************************/

/****************************************************************************/
/***        Macro Definitions                                             ***/
/****************************************************************************/

/****************************************************************************/
/***        Type Definitions                                              ***/
/****************************************************************************/

/****************************************************************************/
/***        Exported Functions                                            ***/
/****************************************************************************/
void printfNode_sData(NODE_tsData *NODE_sData);
void crd_esl_Init(void);
PUBLIC void vCrdEslHwIndHandle(AppQApiHwInd_s *psAHI_Ind);
void crd_esl_vMlmeDcfmInd(MAC_MlmeDcfmInd_s *psMlmeInd);
void crd_vIndAssociate(MAC_MlmeDcfmInd_s *psMlmeInd);
PUBLIC void crd_esl_deepthReq(void);
/****************************************************************************/
/***        Exported Variables                                            ***/
/****************************************************************************/


#endif /* CRD_ESL_H_ */
